[
    {
        "id": "front-end-dev",
        "slug": "front-end-dev",
        "position": "Front-End Developer",
        "text": "We are seeking a talented Front-end Developer to create robust front-end systems for global fintech companies.",
        "description": [
            "You’ll build powerful front-end systems with an improved user experience for our clients worldwide. You‘ll advocate for clients’ needs in the design and development of our applications, especially when implementing new products and features."
        ],
        "challenges": [
            "Find the balance between functional and aesthetic design, and create engaging user interfaces for all our products.",
            "Ensure our products are accessible across all platforms by optimising them for speed, scalability, and usability.",
            "Resolve web-development challenges by employing reusable components and the latest front-end frameworks.",
            "Offer our clients the best user experience by performing automated tests, troubleshooting issues, and making improvements.",
            "​Maintain clear and detailed technical design documentation according to our style guide."
        ],
        "team": "You’ll be part of our Front-end team, where we build the client-side of our web applications by translating UI/UX design wireframes into a user-centric web experience. We advocate for our clients’ needs, and we collaborate with other teams to implement an engaging user interface for our trading platforms.",
        "requirements": [
            "Hands-on experience with JavaScript, HTML, and CSS",
            "Good grasp of diverse testing and debugging methods",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": [
            "Good grasp of UI/UX design processes",
            "Experience in working with React library",
            "Experience with Git",
            "Working experience in open-source platforms like Linux",
            "Strong knowledge of technologies such as Mobx, Gatsby, WebSocket, and styled-components",
            "​Good understanding of back-end technologies"
        ]
    },
    {
        "id": "data-analyst",
        "slug": "data-analyst",
        "position": "Data Analyst",
        "text": "We are looking for a Data Analyst to convert data into actionable insights for leading fintech companies to overcome complex business challenges.",
        "description": [
            "You’ll provide insights by collecting, processing, analysing, and presenting data in a usable way. You’ll ensure data integrity and use data-driven techniques to acquire information to help draft business strategies. Your keen eye for detail and expertise in data analysis will be vital in converting data into actionable insights to solve complex business challenges."
        ],
        "challenges": [
            "Analyse business requirements and create a seamless data flow from the source.",
            "Maintain data integrity, identify and resolve data gaps, convert data for analysis purposes, and create business terminologies for the users.",
            "Work with other departments to recognise and understand the scope of potential problems and check the availability of relevant data to resolve them.",
            "Provide reporting and analysis solutions in the form of dashboards or alerts, and present them to stakeholders.",
            "Use data governance tools for data management and look for trends that can help make business decisions."
        ],
        "team": "We are the Business Intelligence team. We lead the organisation in cultivating a data-driven culture as our company moves toward the future. We collect meaningful data and analytics to deeply understand our clients and build more valuable products and services. What we do is incredibly important in driving smart marketing decisions, optimising our business, and increasing profitability.",
        "requirements": [
            "In-depth experience with reporting packages, SQL, programming (Python/R), and ETL",
            "Frameworks for data wrangling purposes",
            "Skills in data visualisation tools such as Tableau and Google Data Studio",
            "Analytical skills with the ability to transform data into optimal business decisions",
            "Solid background in statistics, mathematics, or engineering",
            "Strong communication and presentation skills",
            "Fluency in spoken and written English"
        ],
        "good_to_have": [
            "Experience with Google Cloud Services (GCS) such as Google Cloud Storage (GCs) and",
            "BigQuery",
            "Quality experience in relational SQL, preferably with PostgreSQL",
            "Understanding the marketing domain of financial products and services"
        ]
    },
    {
        "id": "graphic-designer",
        "slug": "graphic-designer",
        "position": "Graphic Designer",
        "text": "We need a creative Graphic Designer to translate business requirements into captivating designs that will inform and motivate the audience to take action.",
        "description": [
            "You’ll produce captivating designs that inform the audience and call them to action. With your keen eye for aesthetics, you will conceptualise creative solutions for visual challenges. You will play an essential role in building the user interface that brings our products and users together."
        ],
        "challenges": [
            "Develop the design rationale and explain visual choices to cross-functional teams verbally and visually.",
            "Produce high-quality visual designs, including icons, graphics, and marketing materials, for desktop, web, and mobile devices with various resolutions.",
            "Create designs that emphasise our brand, reflect our voice, and inject beauty and life into our products.",
            "Lay out mockups and wireframes for app screens and web pages. ",
            "Collaborate with the Copywriting team to create cohesive designs that will amplify the verbal message.",
            "Keep up with the latest trends and techniques in design, UI, and UX."
        ],
        "team": "We are the Product Design team, a group of designers, researchers, and illustrators. We solve complex problems to create beautiful products with a seamless user experience. We test and iterate our designs while advocating for users throughout the product development cycle.",
        "requirements": [
            "BA/BS in Design (e.g. Human-computer Interaction, Graphic, Visual Communication, Product, or Industrial Design) or equivalent practical experience",
            "Experience with design systems that work across a complex product",
            "Interaction design sensibility",
            "Proficiency in Adobe Photoshop, Illustrator, InDesign, Sketch 3.0",
            "Strong core skills in establishing visual hierarchy, layout, typography, and colour effectively and using visual design to organise information and guide people through tasks",
            "Ability to create style guides to be used cross-functionally",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": []
    },
    {
        "id": "flutter-developer",
        "slug": "flutter-developer",
        "position": "Flutter Developer",
        "text": "We are looking for a Flutter Developer to build advanced Android and iOS applications for fast-paced fintech companies.",
        "description": [
            "You’ll be responsible for designing and developing applications for iOS and Android while working closely with the Product Development team to plan new app features. You will handle debugging and troubleshooting to improve mobile app functionality and create advanced applications."
        ],
        "challenges": [
            "Develop iOS and Android mobile applications, writing high-quality code and tests.",
            "Collaborate with cross-functional teams to analyse data and decide on the best strategies to improve customers’ interaction with our mobile apps.",
            "Prioritise information security and process maintenance throughout the mobile app lifecycle.",
            "Analyse, enhance, and support our existing mobile applications.",
            "Work closely with Quality Assurance, Design, and Product Management teams to build the best possible UX for our mobile apps."
        ],
        "team": "We are the Product Design team, a group of designers, researchers, and illustrators. We solve complex problems to create beautiful products with a seamless user experience. We test and iterate our designs while advocating for users throughout the product development cycle.",
        "requirements": [
            "Experience in the Flutter framework or a keen eagerness to master it",
            "High proficiency and experience in one or more of the following programming languages: Java, Dart, ES6, Kotlin, Objective-C, or Swift",
            "Distinct competence in mobile app development for at least one platform",
            "In-depth understanding of design guidelines and patterns in the Android and iOS platforms and their differences",
            "Strong knowledge of the performance tools and optimisation techniques in Android or iOS SDKs",
            "Proven work experience as a mobile developer in Android and iOS",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": [
            "Demonstrable portfolio of released applications for iOS and Android",
            "Experience in implementing UI animations",
            "Experience in working with finance-related companies"
        ]
    },
    {
        "id": "motion-designer",
        "slug": "motion-designer",
        "position": "Motion Designer",
        "text": "We are seeking a Motion Designer who uses motion to simplify complexity and improve the usability of fintech apps and websites.",
        "description": [
            "You’ll define and create inventive motion designs for our products in collaboration with other designers and developers. You’ll bring innovative ideas to life on various platforms through your mastery of user interface animation, rapid prototyping, and motion studies. Your creations will elevate the motion experience of our clients and tell our brand story."
        ],
        "challenges": [
            "Shape the product narrative by creating UX motion behaviours, systems, and animations that simplify complexity and guide clients. ",
            "Create the motion design approach and strategy by converting early concepts, storyboards, and prototypes into final designs.",
            "Orient and delight clients by producing tutorials and promotional content for different platforms such as web, Android, iOS, and different devices such as laptops, mobiles, and tablets.",
            "Work with the product management team to deliver a motion design in line with the product’s objectives."
        ],
        "team": "We are the Product Design team, a group of designers, researchers, and illustrators. We solve complex problems to create beautiful products with a seamless user experience. We test and iterate our designs while advocating for users throughout the product development cycle.",
        "requirements": [
            "Degree in computer science, design, or a related field",
            "3+ years of experience in motion design",
            "A portfolio that demonstrates experience in creating UI/UX user-centred solutions on various platforms and devices",
            "Skill in using motion graphics programs, such as Principle, Final Cut Pro, and After Effects",
            "The ability to narrate with the use of motion",
            "Familiarity with animation principles",
            "Fluency in spoken and written English"
        ],
        "good_to_have": [
            "Team leading experience with insight into the future direction of the field",
            "Experience in dealing with motion latency issues",
            "Ability to blend art and coding to achieve engaging narrations",
            "Skill in noticing fine details in physics, patterns, and visual design",
            "Portfolio of early concepts as storyboarding sketches"
        ]
    },
    {
        "id": "quantitative-analyst",
        "slug": "quantitative-analyst",
        "position": "Quantitative Analyst",
        "text": "We are looking for a Quantitative Analyst to create business models helping fintech companies to mitigate risk and make sound business decisions.",
        "description": [
            "You’ll design and create new trading products that will allow our clients to trade anything they desire. You’ll use mathematical and financial methods to develop derivatives pricing and risk management algorithms based on real-time market data, new events, and any such parameters impacting the underlying instruments. With your extensive financial knowledge and data analysis skills, you will create models that will help us mitigate risk, make sound business decisions, and introduce a new generation of trading products to the fintech world."
        ],
        "challenges": [
            "Apply mathematical models to real-world scenarios.",
            "Solve complex and abstract mathematical problems to optimise pricing and manage risk.",
            "Analyse trading patterns to identify new market opportunities.",
            "Develop derivatives pricing, as well as risk management models and algorithms.",
            "Review, develop, and enhance options pricing, volatility forecasts, and risk management programmes.",
            "Perform data mining using SQL databases and other analytical tools.",
            "Monitor trading activity across all of our platforms and minimise abuse.",
            "Generate periodic and special reports that summarise client trading trends."
        ],
        "team": "We are the Trading team. We develop the underlying risk and pricing models that drive our products and enable customers to trade on our platforms. We are central to the profitability and success of the company. We track the company’s performance, mitigate risk, and provide useful, actionable insights that help us develop solid business strategies.",
        "requirements": [
            "A university degree in physics, financial engineering, or mathematics",
            "Knowledge of probability theory, stochastic calculus, numerical methods, Monte-Carlo simulation, differential equations, econometrics, derivatives pricing, and statistical modelling",
            "Experience in a programming language such as Python, R, and SQL",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": [
            "Experience in using financial information sources such as Bloomberg and Reuters"
        ]
    },

    {
        "id": "ui-ux-designer",
        "slug": "ui-ux-designer",
        "position": "UI/UX Designer",
        "text": "We are seeking a UI/UX Designer who will transform complex concepts into intuitive, accessible, and user-friendly designs for fast-growing fintech companies.",
        "description": [
            "You’ll inform the design of our websites and apps from the perspective of our end-user. You will have an in-depth understanding of the user requirements, and you will be involved in every aspect of the product development process. You’ll transform complex concepts into intuitive, accessible, and user-friendly designs."
        ],
        "challenges": [
            "Take broad, conceptual ideas and turn them into something useful and valuable for our clients.",
            "Translate concepts into wireframes, mockups, and prototypes that lead to an intuitive user experience.",
            "Help define the user model and interface for new and existing products and features.",
            "Create user personas, define user task flows and UI specifications, and run A/B tests to understand users’ behaviour and needs.",
            "Identify design problems and devise elegant solutions.",
            "Gauge the usability of new and existing products and make constructive suggestions for change.",
            "Take a user-centred design approach and rapidly test and iterate your designs.",
            "Give and solicit feedback from team members in order to continually raise the bar for quality.",
            "Work closely with other teams throughout the development of new products or features.",
            "Give our products a distinct and consistent visual identity, and ensure that it serves the needs of the end-user.",
            "Keep up with the latest trends and techniques in design, UI, and UX."
        ],
        "team": "We are the Product Design team, a group of designers, researchers, and illustrators. We solve complex problems to create beautiful products with a seamless user experience. We test and iterate our designs while advocating for users throughout the product development cycle.",
        "requirements": [
            "A bachelor’s degree in graphic design, interaction design, visual communication, multimedia, or the equivalent",
            "Proven UI and UX experience with a portfolio featuring examples of your design work",
            "Ability to conduct end-to-end UX research, including usability testing, and A/B testing",
            "Experience in interpreting complex concepts and processes to develop intuitive and logical user flows and usage scenarios",
            "Extensive experience in creating interactive UI elements for web and mobile apps",
            "Proficiency in designing intuitive and cohesive screens, pages, and visual elements that work as intended",
            "Proficiency in Photoshop, Illustrator, Sketch, and other design and wireframing software",
            "Knowledge of HTML, CSS, and JavaScript for rapid prototyping of websites and apps",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": ["Familiarity with front-end technologies"]
    },
    {
        "id": "back-end-dev",
        "slug": "back-end-dev",
        "position": "Back-End Developer",
        "text": "We are seeking a Back-end Developer to build automated tests and perform regular reviews to enhance code quality for top fintech companies.",
        "description": [
            "You’ll design and develop reliable server-side apps and databases. By testing and debugging them, you make sure that issues are found and addressed in time. Our client base is growing rapidly, and so is the need to make our system and APIs more scalable. You will play an important role in making our platform scalable by transforming from monolithic to microservice-based architecture.",
            "You’re working with a supportive team who are ready to hear your thoughts, brainstorm when you want fresh ideas, and work with you when you need to delegate. We believe that everyone should be heard and respected. We are also firm believers in open communication, voicing and solving problems early, before they become major obstacles.",
            "Armed with your experience, supported by your team, and motivated by exciting projects, you’re all set for a successful career at Deriv."
        ],
        "challenges": [
            "Design, build, and maintain core components of applications for our customers, internal teams, and third-party developers.",
            "Help to take your code to production, troubleshoot any issues that arise, and own fixing any associated bugs.",
            "Build automated unit and integration tests and perform code reviews to improve the code quality.",
            "Participate in the deployment of new products and features by collaborating with other teams.",
            "Make codebases consistent and maintainable."
        ],
        "team": "We are the Back-end team. We are responsible for designing, developing, testing, and debugging the company’s server-side apps and databases. In collaboration with the QA team, we investigate and resolve technical issues. We empower the Front-end team by providing the components and features that they need. We aspire to delight our customers with a flawless digital experience.",
        "requirements": [
            "Expertise in any modern programming language",
            "Experience in Redis, Git, Docker, and familiarity with microservices and scalable systems",
            "Ability to produce high-quality, self-documenting code by using test-driven development (TDD) techniques",
            "Knowledge of information security and data protection"
        ],
        "good_to_have": [
            "Experience with asynchronous programming and scalable systems",
            "Experience with relational database design and/or open-source RDBMS systems such as PostgreSQL or MySQL",
            "Background in Linux and other open-source platforms",
            "Fluency in spoken and written English"
        ]
    },
    {
        "id": "blockhain-dev",
        "slug": "blockhain-dev",
        "position": "Blockchain Developer",
        "text": "We are seeking a Blockchain Developer who will help with the crypto-cashier system operations and blockchain-based projects for renowned fintech companies.",
        "description": [
            "You’ll help with the operation of our existing crypto-cashier system and play a key role in our future blockchain-based projects. You will develop and maintain secure and efficient software to support our cryptocurrency payments. Your work will directly influence the core architecture that powers our high-traffic digital options trading website."
        ],
        "challenges": [
            "Design, build, and maintain core components of applications for our customers, internal teams, and third-party developers.",
            "Help to take your code to production, troubleshoot any issues that arise, and fix any associated bugs.",
            "Build automated unit and integration tests and perform code reviews to improve the code quality.",
            "Participate in deploying new products and features by collaborating with other teams.",
            "Make codebases consistent and maintainable."
        ],
        "team": "We are the Blockchain Development team, committed to providing transformative solutions to cryptocurrency challenges, building decentralised applications using blockchain technology, and designing an effective architecture for our cryptocurrency transactions. We aim to create a secure and pleasing crypto-experience for our clients.",
        "requirements": [
            "Thorough knowledge of payments with Bitcoin and Ethereum and familiarity with other cryptocurrencies",
            "Experience with Bitcoin or Geth RPC APIs",
            "Understanding of cryptography, including asymmetric, symmetric, hash functions, and encryption/signatures",
            "Familiarity with concepts such as blockchain confirmations, multisig, and HD wallets",
            "Knowledge of coloured coins and Ethereum tokens, including ERC20/23/223",
            "Knowledge of hashing algorithms, including SHA and scrypt"
        ],
        "good_to_have": [
            "Experience with languages such as Perl, Python, PHP, C/C++, Go, Node.js, Rust, or Ruby"
        ]
    },
    {
        "id": "c-plus-plus-dev",
        "slug": "c-plus-plus-dev",
        "position": "C++ Developer",
        "text": "We are looking for a C++ Developer to run tests and applications and work with large codebases for rapidly growing fintech companies.",
        "description": [
            "We’re a fast-paced company, where new products and projects are introduced all the time. To support this, we need a good foundation: fast, reliable, well-tested code that can either run directly on our servers — or on mobile/desktop/web clients. Each component is self-contained, but we encourage cross-team sharing of information and processes — your ideas might spark creativity in other projects.",
            "We recalculate 30 million data points in real-time, and our tech stack should support this volume. This isn’t a legacy codebase, either: expect to see C++20, coroutines and cutting-edge versions of Clang and GCC running on various platforms, including cross-compiled to WebAssembly. We’ve chosen C++ for its performance and portability but are also tracking the progress of such alternatives as Rust. In short, we adapt to new technologies when the need arises, and we need you to do the same, so come with a bold, can-do attitude to master our tech stack.",
            "You’ll be working with a team to build, maintain, and extend the high-performance C++ core features for pricing calculations,  automated trading execution algorithms, and platform integrations with key trading platforms such as MetaTrader 5."
        ],
        "challenges": [
            "Support product development by adding core features to shared libraries.",
            "Achieve high-performance execution targets for all critical components.",
            "Maintain good code quality through documentation and testing."
        ],
        "team": "We are the Back-end team. We are responsible for designing, developing, testing, and debugging the company’s server-side apps and databases. In collaboration with the QA team, we investigate and resolve technical issues. We empower the Front-end team by providing the components and features that they need. We aspire to delight our customers with a flawless digital experience.",
        "requirements": [
            "Expertise in C++, including an in-depth understanding of software design and architecture",
            "Ability to follow technical specifications with little additional guidance or direction",
            "Ideas, enthusiasm, and a teamwork approach"
        ],
        "good_to_have": [
            "Experience with asynchronous programming and scalable systems",
            "Experience with relational database design and/or open-source RDBMS systems such as PostgreSQL or MySQL",
            "Background in Linux and other open-source platforms",
            "Background in trading or quantitative finance",
            "Fluency in spoken and written English"
        ]
    },
    {
        "id": "win-ops-eng",
        "slug": "win-ops-eng",
        "position": "WinOps Engineer",
        "text": "We are seeking a WinOps Engineer to deploy product updates, identify and resolve system issues, and perform production operations.",
        "description": [
            "Are you passionate about automation? Join our WinOps team and apply all your creativity while working on a complex infrastructure of more than 40 servers. We develop a wide range of products and services offered on MT5, and we set ambitious targets to achieve and retain 24/7 availability to our clients.",
            "With over 400,000 active MT5 accounts, we constantly develop new practices and adopt new technologies to ensure reliable, scalable, and uninterrupted trading operations. Your expertise in systems administration and the Windows environment will be essential in overcoming technical and system challenges while working in an Agile environment.",
            "As a Devops Engineer (Windows) in Deriv, you will be contributing to applying the DevOps mindset in the Windows world. In a rapid growth environment, where our technology stack is constantly updated, you will learn new technologies and apply best practices."
        ],
        "challenges": [
            "Explore the dynamics of new technologies–Octopus Deploy, Terraform–and implement automation procedures on the Windows environment with 30+ servers in an effort to eliminate human intervention.",
            "Implement chaos engineering methodology to the production environment to ensure uninterrupted operations with minimal downtime.",
            "Optimise costs and ensure reliability by deploying and maintaining a cloud-agnostic infrastructure.",
            "Implement innovative solutions to automate deployment, configuration, and maintenance of our trading platform to ensure our infrastructure remains at the forefront of technology."
        ],
        "team": "We are the Back-end team. We are responsible for designing, developing, testing, and debugging the company’s server-side apps and databases. In collaboration with the QA team, we investigate and resolve technical issues. We empower the Front-end team by providing the components and features that they need. We aspire to delight our customers with a flawless digital experience.",
        "requirements": [
            "Hands-on experience in Windows system administration and industry-standard security best practices",
            "Expertise in cloud solutions such as AWS and GCP",
            "Experience with advanced Windows PowerShell scripting and/or software development",
            "Experience in working with Agile Software Development and Management methodology",
            "Extensive experience in TCP/IP networking, firewalls, and VPNs",
            "Familiarity with CI/CD pipeline concepts and technologies",
            "Good understanding of application containerization such as Docker",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": [
            "Familiarity with C++ and .Net",
            "Experience in Infrastructure as code methodology (Terraform)",
            "Experience in Configuration as code methodology and configuration management platforms (Octopus Deploy)",
            "Experience in Version control software (Git)"
        ]
    },
    {
        "id": "software-tester",
        "slug": "software-tester",
        "position": "Software Tester",
        "text": "We are seeking a Software Tester to improve the quality of websites, applications, back-end infrastructure, and related systems for leading fintech companies.",
        "description": [
            "You’ll engage in quality control throughout the product development lifecycle of all our products, services, and systems. You will help develop test plans and ensure their execution at each stage, from planning until release. We process over a million transactions per day, and we need you to help deliver the best version of every product, fully optimised, free from bugs, and polished for client utilisation. "
        ],
        "challenges": [
            "Perform high-quality automated and manual tests on the Deriv.com website, applications, backend infrastructure, and related systems.",
            "Collaborate closely with the rest of the QA and IT teams to create, design, and run several types of testing based on different objectives.",
            "Integrate various types of testing into our existing internal and external workflows.",
            "Ensure the integrity of releases by coordinating testing procedures and activities.",
            "Track and keep a detailed record of every bug that you discover.",
            "Identify, document, and investigate issues reported by our clients and the Client Support team.",
            "Replicate reported issues and work with our IT teams to find the root cause, understand the problem, and help come up with solutions."
        ],
        "team": "We are the Quality Assurance team. We are software testing engineers who execute high-quality tests to refine our wide range of products and services. We look after our websites and trading platforms’ quality, usability, and stability to deliver a world-class experience to our end users.",
        "requirements": [
            "Bachelor’s degree in computer science, or an equivalent combination of technical education, training, and work experience",
            "Ability to write high-quality, self-documenting code using test-driven development techniques",
            "Experience in designing and executing test plans (both automated and manual)",
            "Experience with agile development methods such as Scrum or Kanban",
            "Passion for Linux and other open-source platforms",
            "Familiarity with Git",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": [
            "Experience with Postgres or another RDBMS",
            "Extensive knowledge of JavaScript, AJAX, JSON, CSS",
            "Experience in performance and load testing",
            "Proficiency with one or more programming languages, preferably Perl, but can also be Python, PHP, C/C++, etc."
        ]
    },
    {
        "id": "dev-ops",
        "slug": "dev-ops",
        "position": "DevOps Engineer",
        "text": "We are seeking a DevOps Engineer to work closely with developers and testers to ensure the security and smooth running of all systems.",
        "description": [
            "You’ll be deeply involved in every stage of the software lifecycle. You will work closely with developers and testers to facilitate the smooth execution of the continuous integration (CI) process. You must be passionate about connecting software development to day-to-day operations and improving the quality of our products and services."
        ],
        "challenges": [
            "Maintain and extend our service monitoring. We use tools such as Datadog to detect and react to issues. We’ll need you to be proactive and find issues before they happen.",
            "Keep things running. Systems do break from time to time. When they break, your job will be to make it work again. Once it works, walk the developers through the failure so they can prevent it from breaking again.",
            "Keep our systems secure. We have a dedicated security team, but you’ll also need to be ready to fight off intrusions. Defeat any attempts at breaking into our systems.",
            "Help us improve continuously. If you have suggestions for improvement, we’d love to hear about them."
        ],
        "team": "We are the DevOps team. We collaborate with various teams to ensure successful code deployment, component testing, process re-engineering, and quality improvement. With a holistic view of our technical environment, we provide the best solutions that benefit the company and our clients.",
        "requirements": [
            "Expertise in cloud solutions and virtualization infrastructure, including AWS, Google Cloud Platform, and KVM",
            "Familiarity with Linux and open-source applications such as rsyslog, DHCP, iptables, Postfix, NGINX, and initialization systems such as systemd and SysVinit",
            "Extensive experience in TCP/IP networking, firewalls, and VPNs",
            "Knowledge of hardware and software firewalls, intrusion detection methods, security systems, and DDoS protection",
            "Thorough knowledge of bash scripting",
            "Knowledge of Chef, Ansible, SaltStack, or similar configuration management tools",
            "Experience in Site reliability engineering (SRE)",
            "Experience inManaging round-the-clock operations for incident resolution, including alerts, rotations, and escalations",
            "Experience in Designing and working with high-availability web service architecture",
            "Experience in Application containerization (preferably Docker)",
            "Experience in Database administration (preferably PostgresSQL)",
            "Excellent spoken and written English communication skills"
        ],
        "good_to_have": [
            "Extensive knowledge of information security and data protection",
            "Experience with Terraform and Kubernetes",
            "Familiarity with Perl, Python, and other scripting languages",
            "Knowledge of industry-accepted IS standards",
            "Experience in Hardening Linux systems",
            "Experience in CI tools such as Travis-CI, CircleCI, Jenkins etc.",
            "Experience in Documentation of processes and incidents",
            "Experience in Version Control software (Git)",
            "Experience in Windows Server Administration (IIS, MS-SQL)"
        ]
    }
]
